In [52]:
import numpy as np
import pandas as pd

- 4.1

In [53]:
pop = [9904312, 3448737, 2890451, 2466052]
pop2 = [1,2,3,4]
metro = pd.Series(pop, index = ['서울', '부산', '인천', '대구'])
metro2 = pd.Series(pop2, index = ['서울', '부산', '인천', '대전'])

In [54]:
metro + metro2

대구          NaN
대전          NaN
부산    3448739.0
서울    9904313.0
인천    2890454.0
dtype: float64

In [55]:
data = {
    'a': [1,10,1.1,'one','하나'],
    'b': [2,20,2.2,'two','둘'],
    'c': [3,30,3.3,'three','셋'],
    'd': [4,40,4.4,'four','넷'],
    'e': [5,50,5.5,'five','다섯'],
}
columns = ['a','b','c','d','e']
index = ['가','나','다','라','마']
df = pd.DataFrame(data, index=index, columns=columns)
df

     a    b      c     d     e
가    1    2      3     4     5
나   10   20     30    40    50
다  1.1  2.2    3.3   4.4   5.5
라  one  two  three  four  five
마   하나    둘      셋     넷    다섯

In [40]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [41]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [42]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [45]:
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [46]:
del df['평균']
df['영어']['방자'] = 80
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [47]:
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [51]:
df[2:-1]

    국어  영어  수학    평균
향단  70  60  80  70.0

- 4.3

In [56]:
data = {
    'a': [1,10,1.1,'one','하나'],
    'b': [2,20,2.2,'two','둘'],
    'c': [3,30,3.3,'three','셋'],
    'd': [4,40,4.4,'four','넷'],
    'e': [5,50,5.5,'five','다섯'],
}
columns = ['a','b','c','d','e']
index = ['가','나','다','라','마']
df = pd.DataFrame(data, index=index, columns=columns)
df

     a    b      c     d     e
가    1    2      3     4     5
나   10   20     30    40    50
다  1.1  2.2    3.3   4.4   5.5
라  one  two  three  four  five
마   하나    둘      셋     넷    다섯

In [61]:
print(df.loc['마'].e,  df.loc['마', 'e'], df.loc['마']['e'], df.loc['마'][4], df.loc['마'][-1],
df.iloc[4,4], df.iloc[4][4], df.iloc[4]['e'], df.iloc[4].e, df.iloc[-1,-1], df.iloc[-1][-1])

다섯 다섯 다섯 다섯 다섯 다섯 다섯 다섯 다섯 다섯 다섯